imbluedabr/m33mu/cpu/nrf5340/nrf5340_mmio.c
/* m33mu -- an ARMv8-M Emulator
 *
 * SPDX-License-Identifier: AGPL-3.0-or-later
 */
#include <string.h>
#include <stdio.h>
#include <sys/random.h>
#include <sys/types.h>
#include <errno.h>
#include <stdlib.h>
#include "nrf5340/nrf5340_mmio.h"
#include "nrf5340/nrf5340_wdt.h"
#include "nrf5340/nrf5340_cryptocell.h"
#include "m33mu/memmap.h"
#include "m33mu/flash_persist.h"
#include "m33mu/gpio.h"
#include "m33mu/spi_bus.h"

extern void mm_system_request_reset(void);

#define CLOCK_BASE_NS 0x40005000u
#define CLOCK_BASE_S  0x50005000u
#define CLOCK_SIZE    0x1000u

#define CLOCK_TASKS_HFCLKSTART 0x000u
#define CLOCK_TASKS_HFCLKSTOP  0x004u
#define CLOCK_TASKS_LFCLKSTART 0x008u
#define CLOCK_TASKS_LFCLKSTOP  0x00Cu
#define CLOCK_TASKS_HFCLK192MSTART 0x020u
#define CLOCK_TASKS_HFCLK192MSTOP  0x024u
#define CLOCK_EVENTS_HFCLKSTARTED 0x100u
#define CLOCK_EVENTS_LFCLKSTARTED 0x104u
#define CLOCK_EVENTS_HFCLK192MSTARTED 0x124u
#define CLOCK_HFCLKRUN 0x408u
#define CLOCK_HFCLKSTAT 0x40Cu
#define CLOCK_LFCLKRUN 0x414u
#define CLOCK_LFCLKSTAT 0x418u
#define CLOCK_HFCLK192MRUN 0x458u
#define CLOCK_HFCLK192MSTAT 0x45Cu
#define CLOCK_HFCLK192MSRC 0x580u

#define RTC0_BASE_NS 0x40014000u
#define RTC0_BASE_S  0x50014000u
#define RTC_SIZE     0x1000u

#define RTC_TASKS_START 0x000u
#define RTC_TASKS_STOP  0x004u
#define RTC_TASKS_CLEAR 0x008u
#define RTC_EVENTS_TICK 0x100u
#define RTC_EVENTS_OVRFLW 0x104u
#define RTC_EVENTS_COMPARE0 0x140u
#define RTC_COMPARE_COUNT 4u
#define RTC_TASKS_CAPTURE0 0x040u
#define RTC_SHORTS   0x200u
#define RTC_INTENSET 0x304u
#define RTC_INTENCLR 0x308u
#define RTC_EVTEN    0x340u
#define RTC_EVTENSET 0x344u
#define RTC_EVTENCLR 0x348u
#define RTC_COUNTER   0x504u
#define RTC_PRESCALER 0x508u
#define RTC_CC0       0x540u
#define RTC_COUNTER_MASK 0x00FFFFFFu

#define CTRLAP_BASE_NS 0x40006000u
#define CTRLAP_BASE_S  0x50006000u
#define CTRLAP_SIZE    0x1000u

#define IPC_BASE_NS 0x4002A000u
#define IPC_BASE_S  0x5002A000u
#define IPC_SIZE    0x1000u

#define QSPI_BASE_NS 0x4002B000u
#define QSPI_BASE_S  0x5002B000u
#define QSPI_SIZE    0x1000u

#define QSPI_TASKS_ACTIVATE   0x000u
#define QSPI_TASKS_READSTART  0x004u
#define QSPI_TASKS_WRITESTART 0x008u
#define QSPI_TASKS_ERASESTART 0x00Cu
#define QSPI_TASKS_DEACTIVATE 0x010u
#define QSPI_EVENTS_READY     0x100u
#define QSPI_INTEN            0x300u
#define QSPI_INTENSET         0x304u
#define QSPI_INTENCLR         0x308u
#define QSPI_PSEL_BASE        0x524u
#define QSPI_PSEL_SCK         (QSPI_PSEL_BASE + 0x000u)
#define QSPI_PSEL_CSN         (QSPI_PSEL_BASE + 0x004u)

#define GPIO_P0_BASE_NS 0x40842500u
#define GPIO_P1_BASE_NS 0x40842800u
#define GPIO_P0_BASE_S  0x50842500u
#define GPIO_P1_BASE_S  0x50842800u
#define GPIO_SIZE       0x300u

#define GPIO_OUT     0x004u
#define GPIO_OUTSET  0x008u
#define GPIO_OUTCLR  0x00Cu
#define GPIO_IN      0x010u
#define GPIO_DIR     0x014u
#define GPIO_DIRSET  0x018u
#define GPIO_DIRCLR  0x01Cu
#define GPIO_LATCH   0x020u
#define GPIO_DETECTMODE 0x024u
#define GPIO_PIN_CNF0 0x200u

#define NVMC_BASE_NS 0x40039000u
#define NVMC_BASE_S  0x50039000u
#define NVMC_SIZE    0x1000u

#define NVMC_READY   0x400u
#define NVMC_READYNEXT 0x408u
#define NVMC_CONFIG  0x504u
#define NVMC_ERASEPAGE 0x508u
#define NVMC_ERASEALL 0x50Cu
#define NVMC_CONFIGNS 0x584u

#define RNG_BASE_NS 0x40845000u
#define RNG_BASE_S  0x50845000u
#define RNG_SIZE    0x1000u

#define RNG_TASKS_START 0x000u
#define RNG_TASKS_STOP  0x004u
#define RNG_EVENTS_VALRDY 0x100u
#define RNG_INTENSET 0x304u
#define RNG_INTENCLR 0x308u
#define RNG_CONFIG  0x504u
#define RNG_VALUE   0x508u

#define SPU_BASE_S  0x50003000u
#define SPU_SIZE    0x1000u

/* CryptoCell-312: secure-only, no NS alias */
#define CC312_CTRL_BASE_S   0x50844000u
#define CC312_CTRL_SIZE     0x1000u
#define CC312_ENGINE_BASE_S 0x50845000u
#define CC312_ENGINE_SIZE   0x2000u

struct clock_state {
    mm_u32 regs[CLOCK_SIZE / 4];
    mm_bool hfclk_on;
    mm_bool lfclk_on;
    mm_bool hfclk192m_on;
};

struct rtc_state {
    mm_u32 regs[RTC_SIZE / 4];
    mm_u32 cc[RTC_COMPARE_COUNT];
    mm_u64 accum;
    mm_bool running;
};

struct ctrlap_state {
    mm_u32 regs[CTRLAP_SIZE / 4];
};

struct ipc_state {
    mm_u32 regs[IPC_SIZE / 4];
};

struct qspi_state {
    mm_u32 regs[QSPI_SIZE / 4];
    mm_bool active;
};

struct gpio_bank {
    mm_u32 regs[GPIO_SIZE / 4];
    mm_u32 pin_cnf[32];
};

struct nvmc_state {
    mm_u32 regs[NVMC_SIZE / 4];
    mm_u8 *flash;
    mm_u32 flash_size;
    const struct mm_flash_persist *persist;
    mm_u32 flags;
    mm_u32 base_s;
    mm_u32 base_ns;
};

struct rng_state {
    mm_u32 regs[RNG_SIZE / 4];
    mm_u8 value;
    mm_bool running;
};

struct spu_state {
    mm_u32 regs[SPU_SIZE / 4];
};

static struct clock_state clock_state;
static struct rtc_state rtc0_state;
static struct ctrlap_state ctrlap_state;
static struct ipc_state ipc_state;
static struct qspi_state qspi_state;
static struct gpio_bank gpio_banks[2];
static struct nvmc_state nvmc_state;
static struct rng_state rng_state;
static struct spu_state spu_state;
static struct mm_nrf5340_cryptocell *cc312_state;

static mm_bool qspi_trace_enabled(void)
{
    static int cached = -1;
    if (cached < 0) {
        const char *env = getenv("M33MU_QSPI_TRACE");
        cached = (env != 0 && env[0] != '\0' && env[0] != '0') ? 1 : 0;
    }
    return cached ? MM_TRUE : MM_FALSE;
}

static mm_u32 read_slice(mm_u32 reg, mm_u32 offset_in_reg, mm_u32 size_bytes)
{
    mm_u32 shift = offset_in_reg * 8u;
    mm_u32 mask = (size_bytes == 4u) ? 0xFFFFFFFFu : ((1u << (size_bytes * 8u)) - 1u);
    return (reg >> shift) & mask;
}

static mm_u32 apply_write(mm_u32 cur, mm_u32 offset_in_reg, mm_u32 size_bytes, mm_u32 value)
{
    mm_u32 shift = offset_in_reg * 8u;
    mm_u32 mask = (size_bytes == 4u) ? 0xFFFFFFFFu : ((1u << (size_bytes * 8u)) - 1u);
    mm_u32 shifted = (value & mask) << shift;
    return (cur & ~(mask << shift)) | shifted;
}

mm_bool mm_nrf5340_clock_hf_running(void)
{
    return clock_state.hfclk_on;
}

mm_bool mm_nrf5340_clock_lf_running(void)
{
    return clock_state.lfclk_on;
}

static mm_bool nrf5340_rcc_clock_list_line(void *opaque, int line, char *out, size_t out_len)
{
    (void)opaque;
    if (out == 0 || out_len == 0u) {
        return MM_FALSE;
    }
    if (line != 0) {
        if (line != 1) {
            return MM_FALSE;
        }
        if (!clock_state.lfclk_on) {
            return MM_FALSE;
        }
        snprintf(out, out_len, "CLOCK: LFCLK");
        return MM_TRUE;
    }
    if (!clock_state.hfclk_on) {
        return MM_FALSE;
    }
    snprintf(out, out_len, "CLOCK: HFCLK");
    return MM_TRUE;
}

static mm_bool nrf5340_gpio_bank_info(void *opaque, int bank, char *name_out, size_t name_len, int *pins_out)
{
    (void)opaque;
    if (bank < 0 || bank >= 2) {
        return MM_FALSE;
    }
    if (name_out != 0 && name_len > 0u) {
        snprintf(name_out, name_len, "P%d", bank);
    }
    if (pins_out != 0) {
        *pins_out = (bank == 0) ? 32 : 16;
    }
    return MM_TRUE;
}

static mm_bool clock_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct clock_state *clk = (struct clock_state *)opaque;
    if (clk == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > CLOCK_SIZE) return MM_FALSE;

    if (offset == CLOCK_HFCLKRUN && size_bytes == 4) {
        *value_out = clk->hfclk_on ? 1u : 0u;
        return MM_TRUE;
    }
    if (offset == CLOCK_HFCLKSTAT && size_bytes == 4) {
        *value_out = clk->hfclk_on ? 1u : 0u;
        return MM_TRUE;
    }
    if (offset == CLOCK_LFCLKRUN && size_bytes == 4) {
        *value_out = clk->lfclk_on ? 1u : 0u;
        return MM_TRUE;
    }
    if (offset == CLOCK_LFCLKSTAT && size_bytes == 4) {
        *value_out = clk->lfclk_on ? 1u : 0u;
        return MM_TRUE;
    }
    if (offset == CLOCK_HFCLK192MRUN && size_bytes == 4) {
        *value_out = clk->hfclk192m_on ? 1u : 0u;
        return MM_TRUE;
    }
    if (offset == CLOCK_HFCLK192MSTAT && size_bytes == 4) {
        mm_u32 src = clk->regs[CLOCK_HFCLK192MSRC / 4u] & 1u;
        *value_out = clk->hfclk192m_on ? (src | 0x10000u) : src;
        return MM_TRUE;
    }
    *value_out = read_slice(clk->regs[offset / 4], offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool clock_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct clock_state *clk = (struct clock_state *)opaque;
    if (clk == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > CLOCK_SIZE) return MM_FALSE;

