imbluedabr/m33mu/cpu/nrf5340/nrf5340_mmio.c
    if (offset == CLOCK_TASKS_HFCLKSTART && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->hfclk_on = MM_TRUE;
            clk->regs[CLOCK_EVENTS_HFCLKSTARTED / 4] = 1u;
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_HFCLKSTOP && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->hfclk_on = MM_FALSE;
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_LFCLKSTART && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->lfclk_on = MM_TRUE;
            clk->regs[CLOCK_EVENTS_LFCLKSTARTED / 4] = 1u;
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_LFCLKSTOP && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->lfclk_on = MM_FALSE;
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_HFCLK192MSTART && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->hfclk192m_on = MM_TRUE;
            clk->regs[CLOCK_EVENTS_HFCLK192MSTARTED / 4] = 1u;
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_TASKS_HFCLK192MSTOP && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            clk->hfclk192m_on = MM_FALSE;
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_EVENTS_HFCLKSTARTED && size_bytes == 4) {
        if (value == 0u) {
            clk->regs[CLOCK_EVENTS_HFCLKSTARTED / 4] = 0u;
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_EVENTS_LFCLKSTARTED && size_bytes == 4) {
        if (value == 0u) {
            clk->regs[CLOCK_EVENTS_LFCLKSTARTED / 4] = 0u;
        }
        return MM_TRUE;
    }
    if (offset == CLOCK_EVENTS_HFCLK192MSTARTED && size_bytes == 4) {
        if (value == 0u) {
            clk->regs[CLOCK_EVENTS_HFCLK192MSTARTED / 4] = 0u;
        }
        return MM_TRUE;
    }

    clk->regs[offset / 4] = apply_write(clk->regs[offset / 4], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

static mm_bool rtc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct rtc_state *rtc = (struct rtc_state *)opaque;
    if (rtc == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RTC_SIZE) return MM_FALSE;
    if (offset == RTC_COUNTER && size_bytes == 4) {
        *value_out = rtc->regs[RTC_COUNTER / 4] & RTC_COUNTER_MASK;
        return MM_TRUE;
    }
    if (offset >= RTC_CC0 && offset < RTC_CC0 + RTC_COMPARE_COUNT * 4u && size_bytes == 4) {
        mm_u32 idx = (offset - RTC_CC0) / 4u;
        *value_out = rtc->cc[idx] & RTC_COUNTER_MASK;
        return MM_TRUE;
    }
    *value_out = read_slice(rtc->regs[offset / 4], offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool rtc_compare_enabled(const struct rtc_state *rtc, mm_u32 idx)
{
    mm_u32 mask = (1u << (16u + idx));
    if (rtc == 0 || idx >= RTC_COMPARE_COUNT) return MM_FALSE;
    if ((rtc->regs[RTC_EVTEN / 4] & mask) != 0u) return MM_TRUE;
    if ((rtc->regs[RTC_INTENSET / 4] & mask) != 0u) return MM_TRUE;
    return MM_FALSE;
}

static void rtc_set_compare_event(struct rtc_state *rtc, mm_u32 idx)
{
    mm_u32 off = RTC_EVENTS_COMPARE0 + idx * 4u;
    if (rtc == 0 || idx >= RTC_COMPARE_COUNT) return;
    rtc->regs[off / 4] = 1u;
}

static mm_bool rtc_crossed(mm_u32 old, mm_u32 now, mm_u64 ticks, mm_u32 target)
{
    if (ticks == 0u) return MM_FALSE;
    if (ticks >= ((mm_u64)RTC_COUNTER_MASK + 1u)) return MM_TRUE;
    if (old <= now) {
        return (target > old) && (target <= now);
    }
    /* Wrapped. */
    return (target > old) || (target <= now);
}

static mm_bool rtc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct rtc_state *rtc = (struct rtc_state *)opaque;
    if (rtc == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RTC_SIZE) return MM_FALSE;
    if (size_bytes != 4) return MM_FALSE;

    if (offset == RTC_TASKS_START) {
        if ((value & 1u) != 0u) {
            rtc->running = MM_TRUE;
        }
        return MM_TRUE;
    }
    if (offset == RTC_TASKS_STOP) {
        if ((value & 1u) != 0u) {
            rtc->running = MM_FALSE;
        }
        return MM_TRUE;
    }
    if (offset == RTC_TASKS_CLEAR) {
        if ((value & 1u) != 0u) {
            rtc->regs[RTC_COUNTER / 4] = 0u;
        }
        return MM_TRUE;
    }
    if (offset >= RTC_TASKS_CAPTURE0 && offset < RTC_TASKS_CAPTURE0 + RTC_COMPARE_COUNT * 4u) {
        if ((value & 1u) != 0u) {
            mm_u32 idx = (offset - RTC_TASKS_CAPTURE0) / 4u;
            if (idx < RTC_COMPARE_COUNT) {
                rtc->cc[idx] = rtc->regs[RTC_COUNTER / 4] & RTC_COUNTER_MASK;
            }
        }
        return MM_TRUE;
    }
    if (offset == RTC_EVENTS_TICK || offset == RTC_EVENTS_OVRFLW) {
        if (value == 0u) {
            rtc->regs[offset / 4] = 0u;
        }
        return MM_TRUE;
    }
    if (offset >= RTC_EVENTS_COMPARE0 && offset < RTC_EVENTS_COMPARE0 + RTC_COMPARE_COUNT * 4u) {
        if (value == 0u) {
            rtc->regs[offset / 4] = 0u;
        }
        return MM_TRUE;
    }
    if (offset == RTC_SHORTS) {
        rtc->regs[RTC_SHORTS / 4] = value;
        return MM_TRUE;
    }
    if (offset == RTC_INTENSET) {
        rtc->regs[RTC_INTENSET / 4] |= value;
        return MM_TRUE;
    }
    if (offset == RTC_INTENCLR) {
        rtc->regs[RTC_INTENSET / 4] &= ~value;
        return MM_TRUE;
    }
    if (offset == RTC_EVTEN) {
        rtc->regs[RTC_EVTEN / 4] = value;
        return MM_TRUE;
    }
    if (offset == RTC_EVTENSET) {
        rtc->regs[RTC_EVTEN / 4] |= value;
        return MM_TRUE;
    }
    if (offset == RTC_EVTENCLR) {
        rtc->regs[RTC_EVTEN / 4] &= ~value;
        return MM_TRUE;
    }
    if (offset >= RTC_CC0 && offset < RTC_CC0 + RTC_COMPARE_COUNT * 4u) {
        mm_u32 idx = (offset - RTC_CC0) / 4u;
        rtc->cc[idx] = value & RTC_COUNTER_MASK;
        return MM_TRUE;
    }

    rtc->regs[offset / 4] = value;
    return MM_TRUE;
}

void mm_nrf5340_rtc_tick(mm_u64 cycles)
{
    struct rtc_state *rtc = &rtc0_state;
    mm_u64 cpu_hz;
    mm_u64 denom;
    mm_u64 ticks;
    mm_u32 presc;
    mm_u32 old;
    mm_u32 now;
    mm_u32 idx;

    if (!rtc->running) return;
    if (!mm_nrf5340_clock_lf_running()) return;

