imbluedabr/m33mu/cpu/nrf5340/nrf5340_mmio.c
    cpu_hz = mm_nrf5340_cpu_hz();
    if (cpu_hz == 0u) return;

    presc = rtc->regs[RTC_PRESCALER / 4] & 0x0FFFu;
    denom = cpu_hz * (mm_u64)(presc + 1u);

    rtc->accum += cycles * 32768ull;
    ticks = rtc->accum / denom;
    rtc->accum = rtc->accum % denom;
    if (ticks == 0u) return;

    old = rtc->regs[RTC_COUNTER / 4] & RTC_COUNTER_MASK;
    now = (mm_u32)((old + (mm_u32)ticks) & RTC_COUNTER_MASK);
    rtc->regs[RTC_COUNTER / 4] = now;

    for (idx = 0; idx < RTC_COMPARE_COUNT; ++idx) {
        mm_bool crossed;
        if (!rtc_compare_enabled(rtc, idx)) continue;
        crossed = rtc_crossed(old, now, ticks, rtc->cc[idx] & RTC_COUNTER_MASK);
        if (!crossed) continue;
        rtc_set_compare_event(rtc, idx);
        if (idx == 0 && (rtc->regs[RTC_SHORTS / 4] & 1u) != 0u) {
            rtc->regs[RTC_COUNTER / 4] = 0u;
        }
    }
}

static mm_bool ctrlap_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct ctrlap_state *ap = (struct ctrlap_state *)opaque;
    if (ap == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > CTRLAP_SIZE) return MM_FALSE;
    *value_out = read_slice(ap->regs[offset / 4], offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool ctrlap_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct ctrlap_state *ap = (struct ctrlap_state *)opaque;
    if (ap == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > CTRLAP_SIZE) return MM_FALSE;
    ap->regs[offset / 4] = apply_write(ap->regs[offset / 4], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

static mm_bool ipc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct ipc_state *ipc = (struct ipc_state *)opaque;
    if (ipc == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > IPC_SIZE) return MM_FALSE;
    *value_out = read_slice(ipc->regs[offset / 4], offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool ipc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct ipc_state *ipc = (struct ipc_state *)opaque;
    if (ipc == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > IPC_SIZE) return MM_FALSE;
    ipc->regs[offset / 4] = apply_write(ipc->regs[offset / 4], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

static mm_bool qspi_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct qspi_state *qspi = (struct qspi_state *)opaque;
    if (qspi == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > QSPI_SIZE) return MM_FALSE;
    *value_out = read_slice(qspi->regs[offset / 4], offset & 3u, size_bytes);
    if (qspi_trace_enabled() && offset == QSPI_EVENTS_READY && size_bytes == 4u) {
        fprintf(stderr, "[QSPI] EVENTS_READY read => 0x%08lx\n", (unsigned long)*value_out);
    }
    return MM_TRUE;
}

static mm_bool qspi_csn_decode(mm_u32 cfg, int *bank_out, int *pin_out)
{
    mm_u32 connect = (cfg >> 31) & 1u;
    mm_u32 pin = cfg & 0x1Fu;
    mm_u32 port = (cfg >> 5) & 1u;
    if (bank_out == 0 || pin_out == 0) return MM_FALSE;
    if (connect != 0u) return MM_FALSE;
    if (pin > 31u || port > 1u) return MM_FALSE;
    *bank_out = (int)port;
    *pin_out = (int)pin;
    return MM_TRUE;
}

static void qspi_drive_csn(mm_u8 level)
{
    int bank;
    int pin;
    mm_u32 cfg = qspi_state.regs[QSPI_PSEL_CSN / 4];
    if (!qspi_csn_decode(cfg, &bank, &pin)) return;
    if (bank < 0 || bank >= 2 || pin < 0 || pin >= 32) return;
    {
        mm_u32 mask = (pin >= 31) ? 0x80000000u : (1u << (mm_u32)pin);
        if (level == 0u) {
            gpio_banks[bank].regs[GPIO_OUT / 4] &= ~mask;
        } else {
            gpio_banks[bank].regs[GPIO_OUT / 4] |= mask;
        }
        gpio_banks[bank].regs[GPIO_DIR / 4] |= mask;
    }
    mm_spi_bus_poll_cs(0);
}

static void qspi_complete_task(void)
{
    /* QSPI READY is raised in response to tasks except DEACTIVATE. */
    qspi_state.regs[QSPI_EVENTS_READY / 4] = 1u;
}

static mm_bool qspi_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct qspi_state *qspi = (struct qspi_state *)opaque;
    mm_u32 reg_index;
    mm_u32 prev;
    mm_u32 next;
    mm_bool task_trigger = MM_FALSE;
    if (qspi == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > QSPI_SIZE) return MM_FALSE;
    reg_index = offset / 4u;
    prev = qspi->regs[reg_index];
    next = apply_write(prev, offset & 3u, size_bytes, value);

    if (offset == QSPI_EVENTS_READY) {
        if (next == 0u) {
            /* Nordic SDK often clears READY aggressively; keep it asserted
             * while the peripheral is active to avoid deadlock in wait loops. */
            qspi->regs[reg_index] = qspi->active ? 1u : 0u;
        } else {
            qspi->regs[reg_index] = next;
        }
        if (qspi_trace_enabled()) {
            fprintf(stderr,
                    "[QSPI] EVENTS_READY write size=%lu val=0x%08lx => 0x%08lx\n",
                    (unsigned long)size_bytes,
                    (unsigned long)value,
                    (unsigned long)qspi->regs[reg_index]);
        }
        return MM_TRUE;
    }
    if (offset == QSPI_INTEN) {
        qspi->regs[QSPI_INTEN / 4] = next & 1u;
        return MM_TRUE;
    }
    if (offset == QSPI_INTENSET) {
        qspi->regs[QSPI_INTEN / 4] |= (next & 1u);
        return MM_TRUE;
    }
    if (offset == QSPI_INTENCLR) {
        qspi->regs[QSPI_INTEN / 4] &= ~(next & 1u);
        return MM_TRUE;
    }
    if (offset == QSPI_PSEL_CSN) {
        /* Ensure CS is deasserted when pin selection changes. */
        qspi->regs[reg_index] = next;
        qspi_drive_csn(1u);
        return MM_TRUE;
    }

    qspi->regs[reg_index] = next;

    if (offset == QSPI_TASKS_ACTIVATE) {
        task_trigger = (next & 1u) != 0u;
    } else if (offset == QSPI_TASKS_READSTART ||
               offset == QSPI_TASKS_WRITESTART ||
               offset == QSPI_TASKS_ERASESTART) {
        task_trigger = (next & 1u) != 0u;
    } else if (offset == QSPI_TASKS_DEACTIVATE) {
        task_trigger = (next & 1u) != 0u;
        if (task_trigger) {
            qspi->active = MM_FALSE;
            qspi->regs[QSPI_EVENTS_READY / 4] = 0u;
            qspi_drive_csn(1u);
            mm_spi_bus_end(0);
            if (qspi_trace_enabled()) {
                fprintf(stderr, "[QSPI] TASKS_DEACTIVATE trigger\n");
            }
        }
        return MM_TRUE;
    }
    if (qspi_trace_enabled() &&
        (offset == QSPI_TASKS_ACTIVATE ||
         offset == QSPI_TASKS_READSTART ||
         offset == QSPI_TASKS_WRITESTART ||
         offset == QSPI_TASKS_ERASESTART)) {
        fprintf(stderr,
                "[QSPI] TASKS write off=0x%03lx size=%lu val=0x%08lx next=0x%08lx\n",
                (unsigned long)offset,
                (unsigned long)size_bytes,
                (unsigned long)value,
                (unsigned long)next);
    }

    if (!task_trigger) {
        return MM_TRUE;
    }

    qspi->active = MM_TRUE;
    if (offset == QSPI_TASKS_ACTIVATE) {
        qspi_drive_csn(1u);
    } else {
        qspi_drive_csn(0u);
        /* We do not emulate full QSPI transactions yet; release CS. */
        qspi_drive_csn(1u);
        mm_spi_bus_end(0);
    }
    qspi_complete_task();
    if (qspi_trace_enabled()) {
        fprintf(stderr, "[QSPI] task 0x%03lx trigger => EVENTS_READY=1\n", (unsigned long)offset);
    }
    return MM_TRUE;
}

static void gpio_sync_inputs(struct gpio_bank *g)
{
    if (g == 0) return;
    g->regs[GPIO_IN / 4] = g->regs[GPIO_OUT / 4];
}

static mm_bool gpio_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct gpio_bank *g = (struct gpio_bank *)opaque;
    if (g == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > GPIO_SIZE) return MM_FALSE;

