imbluedabr/m33mu/cpu/nrf5340/nrf5340_mmio.c
    if (offset >= GPIO_PIN_CNF0 && size_bytes == 4) {
        mm_u32 pin = (offset - GPIO_PIN_CNF0) / 4u;
        if (pin < 32u) {
            *value_out = g->pin_cnf[pin];
            return MM_TRUE;
        }
    }
    if (offset == GPIO_IN && size_bytes == 4) {
        gpio_sync_inputs(g);
    }
    *value_out = read_slice(g->regs[offset / 4], offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool gpio_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct gpio_bank *g = (struct gpio_bank *)opaque;
    if (g == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > GPIO_SIZE) return MM_FALSE;

    if (offset >= GPIO_PIN_CNF0 && size_bytes == 4) {
        mm_u32 pin = (offset - GPIO_PIN_CNF0) / 4u;
        if (pin < 32u) {
            g->pin_cnf[pin] = value;
            return MM_TRUE;
        }
    }

    if (offset == GPIO_OUT && size_bytes == 4) {
        g->regs[GPIO_OUT / 4] = value;
        gpio_sync_inputs(g);
        return MM_TRUE;
    }
    if (offset == GPIO_OUTSET && size_bytes == 4) {
        g->regs[GPIO_OUT / 4] |= value;
        gpio_sync_inputs(g);
        return MM_TRUE;
    }
    if (offset == GPIO_OUTCLR && size_bytes == 4) {
        g->regs[GPIO_OUT / 4] &= ~value;
        gpio_sync_inputs(g);
        return MM_TRUE;
    }
    if (offset == GPIO_DIR && size_bytes == 4) {
        g->regs[GPIO_DIR / 4] = value;
        return MM_TRUE;
    }
    if (offset == GPIO_DIRSET && size_bytes == 4) {
        g->regs[GPIO_DIR / 4] |= value;
        return MM_TRUE;
    }
    if (offset == GPIO_DIRCLR && size_bytes == 4) {
        g->regs[GPIO_DIR / 4] &= ~value;
        return MM_TRUE;
    }

    g->regs[offset / 4] = apply_write(g->regs[offset / 4], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

static mm_u32 nrf_gpio_bank_read(void *opaque, int bank)
{
    (void)opaque;
    if (bank < 0 || bank >= 2) return 0;
    return gpio_banks[bank].regs[GPIO_OUT / 4];
}

static mm_u32 nrf_gpio_bank_read_moder(void *opaque, int bank)
{
    mm_u32 moder = 0;
    mm_u32 dir;
    int pin;
    (void)opaque;
    if (bank < 0 || bank >= 2) return 0;
    dir = gpio_banks[bank].regs[GPIO_DIR / 4];
    for (pin = 0; pin < 16; ++pin) {
        mm_u32 mode = ((dir >> pin) & 1u) ? 1u : 0u;
        moder |= (mode << (pin * 2));
    }
    return moder;
}

static mm_bool nrf_gpio_bank_clock(void *opaque, int bank)
{
    (void)opaque;
    (void)bank;
    return MM_TRUE;
}

static mm_u32 nrf_gpio_bank_read_seccfgr(void *opaque, int bank)
{
    (void)opaque;
    (void)bank;
    return 0u;
}

static mm_bool nvmc_write_cb(void *opaque,
                             enum mm_sec_state sec,
                             mm_u32 addr,
                             mm_u32 size_bytes,
                             mm_u32 value)
{
    struct nvmc_state *nvmc = (struct nvmc_state *)opaque;
    mm_u32 wen;
    mm_u32 base;
    mm_u32 offset;
    mm_u8 *flash;
    if (nvmc == 0 || nvmc->flash == 0) return MM_FALSE;
    (void)sec;

    wen = nvmc->regs[NVMC_CONFIG / 4] & 0x7u;
    if (wen == 0u) {
        wen = nvmc->regs[NVMC_CONFIGNS / 4] & 0x3u;
    }
    if (wen != 0x1u) {
        return MM_FALSE;
    }

    base = (addr >= nvmc->base_s) ? nvmc->base_s : nvmc->base_ns;
    if (addr < base) return MM_FALSE;
    offset = addr - base;
    if (offset + size_bytes > nvmc->flash_size) return MM_FALSE;

    flash = nvmc->flash;
    if (size_bytes == 4u) {
        mm_u32 cur = (mm_u32)flash[offset] |
                     ((mm_u32)flash[offset + 1u] << 8) |
                     ((mm_u32)flash[offset + 2u] << 16) |
                     ((mm_u32)flash[offset + 3u] << 24);
        mm_u32 next = cur & value;
        flash[offset] = (mm_u8)(next & 0xffu);
        flash[offset + 1u] = (mm_u8)((next >> 8) & 0xffu);
        flash[offset + 2u] = (mm_u8)((next >> 16) & 0xffu);
        flash[offset + 3u] = (mm_u8)((next >> 24) & 0xffu);
    } else if (size_bytes == 2u) {
        mm_u32 cur = (mm_u32)flash[offset] | ((mm_u32)flash[offset + 1u] << 8);
        mm_u32 next = cur & value;
        flash[offset] = (mm_u8)(next & 0xffu);
        flash[offset + 1u] = (mm_u8)((next >> 8) & 0xffu);
    } else if (size_bytes == 1u) {
        flash[offset] &= (mm_u8)(value & 0xffu);
    } else {
        return MM_FALSE;
    }

    if (nvmc->persist != 0 && nvmc->persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)nvmc->persist, addr, size_bytes);
    }
    return MM_TRUE;
}

static void nvmc_erase_all(struct nvmc_state *nvmc)
{
    if (nvmc == 0 || nvmc->flash == 0) return;
    memset(nvmc->flash, 0xFF, nvmc->flash_size);
    if (nvmc->persist != 0 && nvmc->persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)nvmc->persist,
                               nvmc->base_ns,
                               nvmc->flash_size);
    }
}

static void nvmc_erase_page(struct nvmc_state *nvmc, mm_u32 addr)
{
    mm_u32 base;
    mm_u32 offset;
    mm_u32 page_base;
    mm_u32 page_size = 0x1000u;
    if (nvmc == 0 || nvmc->flash == 0) return;
    base = (addr >= nvmc->base_s) ? nvmc->base_s : nvmc->base_ns;
    if (addr < base) return;
    offset = addr - base;
    if (offset >= nvmc->flash_size) return;
    page_base = (offset / page_size) * page_size;
    if (page_base + page_size > nvmc->flash_size) return;
    memset(nvmc->flash + page_base, 0xFF, page_size);
    if (nvmc->persist != 0 && nvmc->persist->enabled) {
        mm_flash_persist_flush((struct mm_flash_persist *)nvmc->persist,
                               base + page_base,
                               page_size);
    }
}

static mm_bool nvmc_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct nvmc_state *nvmc = (struct nvmc_state *)opaque;
    if (nvmc == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > NVMC_SIZE) return MM_FALSE;
    if (offset == NVMC_READY && size_bytes == 4) {
        *value_out = 1u;
        return MM_TRUE;
    }
    if (offset == NVMC_READYNEXT && size_bytes == 4) {
        *value_out = 1u;
        return MM_TRUE;
    }
    *value_out = read_slice(nvmc->regs[offset / 4], offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool nvmc_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct nvmc_state *nvmc = (struct nvmc_state *)opaque;
    mm_u32 wen;
    if (nvmc == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > NVMC_SIZE) return MM_FALSE;

    wen = nvmc->regs[NVMC_CONFIG / 4] & 0x7u;
    if (wen == 0u) {
        wen = nvmc->regs[NVMC_CONFIGNS / 4] & 0x3u;
    }

    if (offset == NVMC_ERASEALL && size_bytes == 4) {
        if (wen == 0x2u && (value & 1u) != 0u) {
            nvmc_erase_all(nvmc);
        }
        return MM_TRUE;
    }

