imbluedabr/m33mu/cpu/nrf5340/nrf5340_mmio.c
    if (offset == NVMC_ERASEPAGE && size_bytes == 4) {
        if (wen == 0x2u) {
            nvmc_erase_page(nvmc, value);
        }
        return MM_TRUE;
    }

    nvmc->regs[offset / 4] = apply_write(nvmc->regs[offset / 4], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

static mm_bool rng_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct rng_state *rng = (struct rng_state *)opaque;
    ssize_t n;
    if (rng == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RNG_SIZE) return MM_FALSE;

    if (offset == RNG_VALUE && size_bytes == 4) {
        if (!rng->running) {
            *value_out = (mm_u32)rng->value;
            return MM_TRUE;
        }
        for (;;) {
            n = getrandom(&rng->value, sizeof(rng->value), 0);
            if (n == (ssize_t)sizeof(rng->value)) {
                break;
            }
            if (n < 0 && errno == EINTR) {
                continue;
            }
            fprintf(stderr, "[RNG] getrandom failed: %s\n",
                    (n < 0) ? strerror(errno) : "short read");
            exit(1);
        }
        rng->regs[RNG_EVENTS_VALRDY / 4] = 1u;
        *value_out = (mm_u32)rng->value;
        return MM_TRUE;
    }

    *value_out = read_slice(rng->regs[offset / 4], offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool rng_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct rng_state *rng = (struct rng_state *)opaque;
    ssize_t n;
    if (rng == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > RNG_SIZE) return MM_FALSE;

    if (offset == RNG_TASKS_START && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            rng->running = MM_TRUE;
            for (;;) {
                n = getrandom(&rng->value, sizeof(rng->value), 0);
                if (n == (ssize_t)sizeof(rng->value)) {
                    break;
                }
                if (n < 0 && errno == EINTR) {
                    continue;
                }
                fprintf(stderr, "[RNG] getrandom failed: %s\n",
                        (n < 0) ? strerror(errno) : "short read");
                exit(1);
            }
            rng->regs[RNG_EVENTS_VALRDY / 4] = 1u;
        }
        return MM_TRUE;
    }
    if (offset == RNG_TASKS_STOP && size_bytes == 4) {
        if ((value & 1u) != 0u) {
            rng->running = MM_FALSE;
        }
        return MM_TRUE;
    }
    if (offset == RNG_EVENTS_VALRDY && size_bytes == 4) {
        if (value == 0u) {
            rng->regs[RNG_EVENTS_VALRDY / 4] = 0u;
        } else {
            rng->regs[RNG_EVENTS_VALRDY / 4] = value;
        }
        return MM_TRUE;
    }
    if (offset == RNG_INTENSET && size_bytes == 4) {
        rng->regs[RNG_INTENSET / 4] |= value;
        return MM_TRUE;
    }
    if (offset == RNG_INTENCLR && size_bytes == 4) {
        rng->regs[RNG_INTENSET / 4] &= ~value;
        return MM_TRUE;
    }

    rng->regs[offset / 4] = apply_write(rng->regs[offset / 4], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

static mm_bool spu_read(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 *value_out)
{
    struct spu_state *spu = (struct spu_state *)opaque;
    if (spu == 0 || value_out == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > SPU_SIZE) return MM_FALSE;
    *value_out = read_slice(spu->regs[offset / 4], offset & 3u, size_bytes);
    return MM_TRUE;
}

static mm_bool spu_write(void *opaque, mm_u32 offset, mm_u32 size_bytes, mm_u32 value)
{
    struct spu_state *spu = (struct spu_state *)opaque;
    if (spu == 0 || size_bytes == 0 || size_bytes > 4) return MM_FALSE;
    if ((offset + size_bytes) > SPU_SIZE) return MM_FALSE;
    spu->regs[offset / 4] = apply_write(spu->regs[offset / 4], offset & 3u, size_bytes, value);
    return MM_TRUE;
}

mm_bool mm_nrf5340_register_mmio(struct mmio_bus *bus)
{
    struct mmio_region reg;
    if (bus == 0) return MM_FALSE;
    memset(&reg, 0, sizeof(reg));

    memset(&clock_state, 0, sizeof(clock_state));
    clock_state.hfclk_on = MM_TRUE;

    memset(&rtc0_state, 0, sizeof(rtc0_state));
    memset(&ctrlap_state, 0, sizeof(ctrlap_state));
    memset(&ipc_state, 0, sizeof(ipc_state));
    memset(&qspi_state, 0, sizeof(qspi_state));
    memset(&gpio_banks, 0, sizeof(gpio_banks));
    memset(&nvmc_state, 0, sizeof(nvmc_state));
    memset(&rng_state, 0, sizeof(rng_state));
    memset(&spu_state, 0, sizeof(spu_state));

    reg.base = CLOCK_BASE_NS;
    reg.size = CLOCK_SIZE;
    reg.opaque = &clock_state;
    reg.read = clock_read;
    reg.write = clock_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = CLOCK_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = RTC0_BASE_NS;
    reg.size = RTC_SIZE;
    reg.opaque = &rtc0_state;
    reg.read = rtc_read;
    reg.write = rtc_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = RTC0_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = CTRLAP_BASE_NS;
    reg.size = CTRLAP_SIZE;
    reg.opaque = &ctrlap_state;
    reg.read = ctrlap_read;
    reg.write = ctrlap_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = CTRLAP_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = IPC_BASE_NS;
    reg.size = IPC_SIZE;
    reg.opaque = &ipc_state;
    reg.read = ipc_read;
    reg.write = ipc_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = IPC_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = QSPI_BASE_NS;
    reg.size = QSPI_SIZE;
    reg.opaque = &qspi_state;
    reg.read = qspi_read;
    reg.write = qspi_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = QSPI_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = GPIO_P0_BASE_NS;
    reg.size = GPIO_SIZE;
    reg.opaque = &gpio_banks[0];
    reg.read = gpio_read;
    reg.write = gpio_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIO_P0_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base = GPIO_P1_BASE_NS;
    reg.opaque = &gpio_banks[1];
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = GPIO_P1_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

