imbluedabr/m33mu/cpu/nrf5340/nrf5340_mmio.c
    reg.base = NVMC_BASE_NS;
    reg.size = NVMC_SIZE;
    reg.opaque = &nvmc_state;
    reg.read = nvmc_read;
    reg.write = nvmc_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = NVMC_BASE_S;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    /* Note: RNG_BASE_NS/S (0x40845000/0x50845000) is the CC-312 engine base.
     * The real nRF5340 does not have a standalone RNG at this address —
     * random generation is provided by CC_RNG inside the CryptoCell block.
     * The CC-312 engine region registered below covers this address range.
     * The rng_state and rng_read/write are retained for potential future
     * use but are not registered as a separate MMIO region. */
    (void)rng_read;
    (void)rng_write;

    reg.base = SPU_BASE_S;
    reg.size = SPU_SIZE;
    reg.opaque = &spu_state;
    reg.read = spu_read;
    reg.write = spu_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    if (!mm_nrf5340_wdt_register(bus)) return MM_FALSE;

    /* CryptoCell-312: secure-only regions */
    if (cc312_state == NULL) {
        cc312_state = mm_nrf5340_cryptocell_new();
        if (cc312_state == NULL) return MM_FALSE;
    }
    mm_nrf5340_cryptocell_reset(cc312_state);

    reg.base  = CC312_CTRL_BASE_S;
    reg.size  = CC312_CTRL_SIZE;
    reg.opaque = cc312_state;
    reg.read  = mm_nrf5340_cryptocell_ctrl_read;
    reg.write = mm_nrf5340_cryptocell_ctrl_write;
    reg.name  = "cc312_ctrl";
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    reg.base  = CC312_ENGINE_BASE_S;
    reg.size  = CC312_ENGINE_SIZE;
    reg.opaque = cc312_state;
    reg.read  = mm_nrf5340_cryptocell_read;
    reg.write = mm_nrf5340_cryptocell_write;
    reg.name  = "cc312_engine";
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;

    mm_gpio_bank_set_reader(nrf_gpio_bank_read, 0);
    mm_gpio_bank_set_moder_reader(nrf_gpio_bank_read_moder, 0);
    mm_gpio_bank_set_clock_reader(nrf_gpio_bank_clock, 0);
    mm_gpio_bank_set_seccfgr_reader(nrf_gpio_bank_read_seccfgr, 0);

    return MM_TRUE;
}

void mm_nrf5340_flash_bind(struct mm_memmap *map,
                           mm_u8 *flash,
                           mm_u32 flash_size,
                           const struct mm_flash_persist *persist,
                           mm_u32 flags)
{
    if (map == 0) return;
    nvmc_state.flash = flash;
    nvmc_state.flash_size = flash_size;
    nvmc_state.persist = persist;
    nvmc_state.flags = flags;
    nvmc_state.base_s = map->flash_base_s;
    nvmc_state.base_ns = map->flash_base_ns;
    mm_memmap_set_flash_writer(map, nvmc_write_cb, &nvmc_state);

    /* Wire memmap into CryptoCell-312 so DMA can read/write target RAM */
    if (cc312_state != 0) {
        mm_nrf5340_cryptocell_set_memmap(cc312_state, map);
    }
}

void mm_nrf5340_set_nvic(struct mm_nvic *nvic)
{
    if (cc312_state != 0) {
        mm_nrf5340_cryptocell_set_nvic(cc312_state, nvic);
    }
}

mm_u64 mm_nrf5340_cpu_hz(void)
{
    return 128000000ull;
}

void mm_nrf5340_mmio_reset(void)
{
    memset(&clock_state, 0, sizeof(clock_state));
    clock_state.hfclk_on = MM_TRUE;
    clock_state.lfclk_on = MM_FALSE;
    clock_state.hfclk192m_on = MM_FALSE;
    clock_state.regs[CLOCK_EVENTS_HFCLKSTARTED / 4] = 0u;
    clock_state.regs[CLOCK_EVENTS_LFCLKSTARTED / 4] = 0u;
    clock_state.regs[CLOCK_EVENTS_HFCLK192MSTARTED / 4] = 0u;
    clock_state.regs[CLOCK_HFCLK192MSRC / 4] = 1u;

    memset(&rtc0_state, 0, sizeof(rtc0_state));
    memset(&ctrlap_state, 0, sizeof(ctrlap_state));
    memset(&ipc_state, 0, sizeof(ipc_state));
    memset(&qspi_state, 0, sizeof(qspi_state));
    memset(&gpio_banks, 0, sizeof(gpio_banks));
    memset(&rng_state, 0, sizeof(rng_state));
    memset(&spu_state, 0, sizeof(spu_state));

    memset(nvmc_state.regs, 0, sizeof(nvmc_state.regs));
    nvmc_state.regs[NVMC_READY / 4] = 1u;
    nvmc_state.regs[NVMC_READYNEXT / 4] = 1u;
    nvmc_state.regs[NVMC_CONFIG / 4] = 0u;

    mm_gpio_set_bank_info_reader(nrf5340_gpio_bank_info, 0);
    mm_rcc_set_clock_list_reader(nrf5340_rcc_clock_list_line, 0);
    mm_nrf5340_wdt_reset();

    if (cc312_state != 0) {
        mm_nrf5340_cryptocell_reset(cc312_state);
    }
}
